
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    [{"authors":null,"categories":null,"content":"Professional Summary Gopika Govindan is a Clinical Psychologist with over a decade of diverse international experience across the UK, USA, Greece, UAE, India, and Austria. Her work spans clinical consultancy for hospitals and corporates, and she has previously served as the Clinical Director for the Ghobash Group of Clinics in Abu Dhabi and Dubai, where she led rehabilitation teams and clinical operations.\nAcademically, she holds an MSc in Clinical and Abnormal Psychology from (UK) and an MPhil in Clinical Psychology from (India). She’s also a certified Neuro-Cognitive Trainer (Brain Rx, USA), a UK Board-Certified Dance Movement Therapist, and an NLP Practitioner. My career began in 2009 with the NHS UK at in Wales (UK), supporting individuals through complex psychological challenges.\nMy therapeutic work embraces a holistic and multidisciplinary approach, collaborating closely with doctors and fellow therapists. I was also an active volunteer with the ’s COVID-19 Mental Health Task Force, delivering psychological first aid during the pandemic.\nMy areas of expertise include:\nCognitive Behaviour Therapy (CBT) Habit Reversal Therapy (HRT) Dialectical Behaviour Therapy (DBT) Acceptance and Commitment Therapy (ACT) Mindfulness-Based Therapy I offer online psychotherapy for both adolescents and adults, using an eclectic and personalized approach to support each individual’s journey toward healing, resilience, and self-discovery.\n","date":1906549200,"expirydate":-62135596800,"kind":"term","lang":"en","lastmod":1906549200,"objectID":"2525497d367e79493fd32b198b28f040","permalink":"","publishdate":"2025-07-25T00:00:00Z","relpermalink":"","section":"authors","summary":"Professional Summary Gopika Govindan is a Clinical Psychologist with over a decade of diverse international experience across the UK, USA, Greece, UAE, India, and Austria. Her work spans clinical consultancy for hospitals and corporates, and she has previously served as the Clinical Director for the Ghobash Group of Clinics in Abu Dhabi and Dubai, where she led rehabilitation teams and clinical operations.\n","tags":null,"title":"Gopika Govindan","type":"authors"},{"authors":["Gopika Govindan"],"categories":null,"content":" Click on the Slides button above to view the built-in slides feature. Slides can be added in a few ways:\nCreate slides using Hugo Blox Builder’s feature and link using slides parameter in the front matter of the talk file Upload an existing slide deck to static/ and link using url_slides parameter in the front matter of the talk file Embed your slides (e.g. Google Slides) or presentation video on this page using . Further event details, including such as image galleries, can be added to the body of this page.\n","date":1906549200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1906549200,"objectID":"a8edef490afe42206247b6ac05657af0","permalink":"http://localhost:1313/event/example/","publishdate":"2017-01-01T00:00:00Z","relpermalink":"/event/example/","section":"event","summary":"An example talk using Hugo Blox Builder's Markdown slides feature.","tags":[],"title":"Example Talk","type":"event"},{"authors":["Gopika Govindan"],"categories":null,"content":"\rPrivilege doesn’t just open doors. It rewires how we think, feel, and behave. It can dull empathy, inflate entitlement, and lead us to unconsciously hurt others — and ourselves.\n🧠 Science backs this up: ✔️ Reduced empathy – Privilege lowers sensitivity to others’ pain ( ) ✔️ Entitlement schemas – “I deserve more because I am more” (Young, Schema Therapy) ✔️ Moral licensing – “I’ve done good, so I can act selfishly now” (Merritt et al., 2010) ✔️ In-group bias – Unconscious favoritism toward those like us 🌍 Left unchecked, privilege can shape entire cultures: ⚠️ Workplace toxicity ⚠️ Biased leadership ⚠️ Disconnection ⚠️ Erosion of trust Privilege, unchecked, becomes a public mental health issue.\nA Personal Reflection I grew up with privilege. But my parents raised me differently.\nThey never gave sermons about humility — they embodied it.\nTrue respect doesn’t need applause.\nIt’s how you speak to someone who can do nothing for you.\nIt’s greeting the doorman and the CEO with the same warmth.\nIt’s seeing dignity in everyone — not just in those who mirror your world.\nOne moment stuck with me for decades.\nAs a child, I once asked why we were taking a longer route home just to drop someone off.\nThey answered:\n“Comfort is not something we protect just for ourselves.”\nThat sentence never left me.\n🔧 So… How Do We Fix This? 🛠 Cognitive restructuring – Challenge superiority narratives 🧠 Perspective-taking – Practice until it’s automatic 📉 Shrink power distance – Especially in leadership and policy 🗣 Safe feedback loops – Make it easier to hear hard truths 🧭 Recenter on values – Choose connection over comfort Ask Yourself: “Where am I insulated from the consequences others face — and how has that shaped my behavior?”\nPrivilege isn’t the villain.\nUnexamined privilege is.\nLet’s build cultures that are aware, humble, and deeply human.\n🙏 To my parents:\nThank you for teaching me that real strength whispers. It doesn’t shout.\n","date":1753401600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1753401600,"objectID":"9a893d25055ecd6e21d39b0f30832320","permalink":"http://localhost:1313/publication/25_07_25_previlige/","publishdate":"2025-07-25T00:00:00Z","relpermalink":"/publication/25_07_25_previlige/","section":"publication","summary":"A reflection on how privilege silently rewires empathy, behavior, and leadership — backed by science and shaped by experience.","tags":["Psychology","Leadership"],"title":"Privilege Changes Your Brain — and Not for the Better","type":"publication"},{"authors":["Gopika Govindan"],"categories":null,"content":"\rVisiting the United Nations Office at Vienna (UNOV) 🌐 was more of a deeply personal highlight for me.\nGrowing up, I would often listen in awe as my father shared stories of his work with the UN, particularly with WHO and UNICEF in the 1970s. His experiences painted vivid pictures of purpose, global cooperation and the impact of working for something greater than oneself. Those stories sparked a lifelong fascination in me.\nFrom learning about the work of organizations like UNODC, IAEA and UNIDO to engaging in thought-provoking discussions about peace, sustainability and global development, the experience left me with a deepened appreciation for multilateral collaboration and diplomacy.\nThe visit reminded me of the power of dialogue, unity and shared responsibility in addressing the challenges our world faces today from climate action to human rights and beyond.\n🤝 Here is to generational inspiration.\n🌐 Here is to purpose-driven work that transcends borders.\nGrateful for this opportunity to visit and excited to bring these insights back into my own clinical work and mission.\n","date":1752796800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1752796800,"objectID":"484d40f4622e81b233666e7b62df25c0","permalink":"http://localhost:1313/publication/25_07_18_un_visit/","publishdate":"2025-07-18T00:00:00Z","relpermalink":"/publication/25_07_18_un_visit/","section":"publication","summary":"A reflection on how privilege silently rewires empathy, behavior, and leadership — backed by science and shaped by experience.","tags":["Outreach","Psychology","Humanrights"],"title":"A Full-Circle Moment at the United Nations, Vienna","type":"publication"},{"authors":["Gopika Govindan"],"categories":null,"content":"\rIt flows silently through generations — not always as memories, but as biology. What our parents endured, what their parents suppressed, and what no one dared to speak about — it lives on in our stress responses, our fears, our reactions.\nAnd nowhere is this more evident than in schools.🏫\n🔫 When Students Bring Weapons, We’re Asking the Wrong Question Too often, when a young person brings a weapon to school, we rush to ask:\n“What’s wrong with them?”\nBut what if we shifted the question?\n“What happened to their nervous system?”\nBecause what may look like defiance is often the survival strategy of a brain trained by chaos:\nA mind wired by hypervigilance A body stuck in fight-or-flight A soul that’s never been taught how to feel safe Violence doesn’t erupt from nowhere. It often emerges from chronic trauma, unprocessed pain, and missed moments of connection that could’ve changed a life.\n🔬 The Neurodevelopmental Truth Modern neuroscience is clear: trauma rewires the brain.\n🧠 Chronic stress shrinks the prefrontal cortex — the part responsible for reasoning, planning, and impulse control. At the same time, it overactivates the amygdala, the fear center, making a person quicker to anger, slower to reflect, and constantly primed for danger — even where there is none.\n🧬 Generational trauma isn’t just psychological — it’s physiological. Elevated cortisol levels, emotional neglect, and systemic disconnection shape the developing brain long before a child learns to speak. Many students are not just reacting to their trauma — they’re carrying ours.\n⛓ Punishment Doesn’t Heal Pain — It Deepens It We still suspend, expel, and isolate dysregulated students, expecting compliance through consequence.\nBut you can’t punish a nervous system back into safety.\nSuspension is not a solution — it’s often retraumatization.\nA child who lashes out is not asking to be controlled. They’re asking — often wordlessly — to feel safe, to be seen, to be soothed.\n🔑 What Actually Prevents School Violence? If we truly want to prevent school violence, we have to treat the root — not just the symptoms.\nHere’s what works:\n✔️ Model co-regulation over control. Children don’t self-regulate by being scolded — they co-regulate by being around calm, grounded adults who show them how.\n✔️ Make Social-Emotional Learning (SEL) a daily practice. SEL isn’t an “extra.” It’s brain training. It strengthens the neural pathways that support emotional resilience and empathy.\n✔️ Embed trauma-informed clinicians in schools. Mental health must be as accessible as math class. Kids can’t learn when their brains are stuck in survival.\n✔️ Screen early for trauma and executive dysfunction. Not all wounds are visible. Some show up as attention issues, impulsivity, or silence. Catching them early can change a child’s trajectory.\n✔️ Shift from zero-tolerance to relational restoration. Connection changes behavior far more than exclusion ever will. Restoration builds trust, and trust transforms behavior.\n💡 Safety Over Fear Let’s be clear: fear doesn’t prevent violence. Safety does.\nWhen students feel safe — not just physically, but emotionally and relationally — they are less likely to harm others or themselves. A safe environment is not one filled with metal detectors and punishments — it’s one filled with adults who see the whole child, not just the behavior.\nFinal Reflection We have a choice.\nWe can label these children as “problems to be managed.”\nOr we can recognize them as nervous systems in need of repair.\nBecause beneath every act of violence is often a story of pain, misattunement, and disconnection — waiting to be heard, healed, and held.\n“Comfort is not something we protect just for ourselves.” (a lesson from my parents that still echoes today)\nLet’s extend that truth to our schools. Let’s build systems that don’t just manage trauma — but truly work to prevent it.\nBecause the best violence prevention strategy isn’t control.\nIt’s compassion + neuroscience + connection — in action.\n","date":1751587200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1751587200,"objectID":"8f24c03ca6afcd840fa78ded8501dd4a","permalink":"http://localhost:1313/publication/25_07_01_trauma/","publishdate":"2025-07-04T00:00:00Z","relpermalink":"/publication/25_07_01_trauma/","section":"publication","summary":"Understanding generational trauma and how it impacts you.","tags":["Trauma","Psychology"],"title":"We Inherit More Than Eye Color: The Hidden Neuroscience of Generational Trauma","type":"publication"},{"authors":null,"categories":null,"content":"","date":1716076800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1716076800,"objectID":"3c42bb4157bf51d85ae7ffc4e1685909","permalink":"http://localhost:1313/projects/","publishdate":"2024-05-19T00:00:00Z","relpermalink":"/projects/","section":"","summary":"","tags":null,"title":"Projects","type":"landing"},{"authors":["Gopika Govindan","Ted"],"categories":null,"content":"Welcome 👋\nTable of Contents Overview Get Started Crowd-funded open-source software ❤️ Click here to become a sponsor and help support Hugo Blox’s future ❤️ Ecosystem Inspiration Features Themes License Overview The Hugo Blox website builder for Hugo, along with its starter templates, is designed for professional creators, educators, and teams/organizations - although it can be used to create any kind of site The template can be modified and customised to suit your needs. It’s a good platform for anyone looking to take control of their data and online identity whilst having the convenience to start off with a no-code solution (write in Markdown and customize with YAML parameters) and having flexibility to later add even deeper personalization with HTML and CSS You can work with all your favourite tools and apps with hundreds of plugins and integrations to speed up your workflows, interact with your readers, and much more Get Started 👉 📚 💬 or 🐦 Twitter: #MadeWithHugoBlox 💡 ⬆️ Updating Hugo Blox? View the and Crowd-funded open-source software To help us develop this template and software sustainably under the MIT license, we ask all individuals and businesses that use it to help support its ongoing maintenance and development via sponsorship.\nAs a token of appreciation for sponsoring, you can unlock awesome rewards and extra features 🦄✨\nEcosystem : Automatically import publications from BibTeX Inspiration are building with this template.\nFeatures Page builder - Create anything with no-code and Edit any type of content - Blog posts, publications, talks, slides, projects, and more! Create content in , , or Plugin System - Fully customizable Display Code and Math - Code syntax highlighting and LaTeX math supported Integrations - , , Maps, Contact Forms, and more! Beautiful Site - Simple and refreshing one-page design Industry-Leading SEO - Help get your website found on search engines and social media Media Galleries - Display your images and videos with captions in a customizable gallery Mobile Friendly - Look amazing on every screen with a mobile friendly version of your site Multi-language - 35+ language packs including English, 中文, and Português Multi-user - Each author gets their own profile page Privacy Pack - Assists with GDPR Stand Out - Bring your site to life with animation, parallax backgrounds, and scroll effects One-Click Deployment - No servers. No databases. Only files. Themes Hugo Blox and its templates come with automatic day (light) and night (dark) mode built-in. Visitors can choose their preferred mode by clicking the sun/moon icon in the header.\nfor your site. Themes are fully customizable.\nLicense Copyright 2016-present .\nReleased under the license.\n","date":1698364800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698364800,"objectID":"36b31dcee3bc57fcedd3cd823748254f","permalink":"http://localhost:1313/post/get-started/","publishdate":"2023-10-27T00:00:00Z","relpermalink":"/post/get-started/","section":"post","summary":"Take full control of your personal brand and privacy by migrating away from the big tech platforms!","tags":["Academic","Hugo Blox","Markdown"],"title":"🎉 Easily create your own simple yet highly customizable blog","type":"post"},{"authors":null,"categories":null,"content":"Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures.\n","date":1698278400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698278400,"objectID":"ac03e43170b379c086748d4a8c1013b9","permalink":"http://localhost:1313/project/pandas/","publishdate":"2023-10-26T00:00:00Z","relpermalink":"/project/pandas/","section":"project","summary":"Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures.\n","tags":["Hugo","Wowchemy","Markdown"],"title":"Pandas","type":"project"},{"authors":null,"categories":null,"content":"PyTorch is a Python package that provides tensor computation (like NumPy) with strong GPU acceleration.\n","date":1698278400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698278400,"objectID":"863326fa93a719a784f46e8be65562c1","permalink":"http://localhost:1313/project/pytorch/","publishdate":"2023-10-26T00:00:00Z","relpermalink":"/project/pytorch/","section":"project","summary":"PyTorch is a Python package that provides tensor computation (like NumPy) with strong GPU acceleration.\n","tags":["Hugo","Wowchemy","Markdown"],"title":"PyTorch","type":"project"},{"authors":null,"categories":null,"content":"scikit-learn is a Python module for machine learning built on top of SciPy and is distributed under the 3-Clause BSD license.\n","date":1698278400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698278400,"objectID":"26ae9fc75e3b90f8c2f6ee2b62a63faf","permalink":"http://localhost:1313/project/scikit/","publishdate":"2023-10-26T00:00:00Z","relpermalink":"/project/scikit/","section":"project","summary":"scikit-learn is a Python module for machine learning built on top of SciPy and is distributed under the 3-Clause BSD license.\n","tags":["Hugo","Wowchemy","Markdown"],"title":"scikit-learn","type":"project"},{"authors":["Gopika Govindan"],"categories":null,"content":"Create a personal knowledge base and share your knowledge with your peers.\nHugo Blox web framework empowers you with one of the most flexible note-taking capabilities out there.\nCreate a powerful knowledge base that works on top of a local folder of plain text Markdown files.\nUse it as your second brain, either publicly sharing your knowledge with your peers via your website, or via a private GitHub repository and password-protected site just for yourself.\nMindmaps Hugo Blox supports a Markdown extension for mindmaps.\nWith this open format, can even edit your mindmaps in other popular tools such as Obsidian.\nSimply insert a Markdown code block labelled as markmap and optionally set the height of the mindmap as shown in the example below.\nMindmaps can be created by simply writing the items as a Markdown list within the markmap code block, indenting each item to create as many sub-levels as you need:\n```markmap {height=\u0026#34;200px\u0026#34;}\r- Hugo Modules\r- Hugo Blox\r- blox-plugins-netlify\r- blox-plugins-netlify-cms\r- blox-plugins-reveal\r```\rrenders as\n- Hugo Modules\r- Hugo Blox\r- blox-plugins-netlify\r- blox-plugins-netlify-cms\r- blox-plugins-reveal Anh here’s a more advanced mindmap with formatting, code blocks, and math:\n```markmap\r- Mindmaps\r- Links\r- [Hugo Blox Docs](https://docs.hugoblox.com/)\r- [Discord Community](https://discord.gg/z8wNYzb)\r- [GitHub](https://github.com/HugoBlox/hugo-blox-builder)\r- Features\r- Markdown formatting\r- **inline** ~~text~~ *styles*\r- multiline\rtext\r- `inline code`\r-\r```js\rconsole.log(\u0026#39;hello\u0026#39;);\rconsole.log(\u0026#39;code block\u0026#39;);\r```\r- Math: $x = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}$\r```\rrenders as\n- Mindmaps\r- Links\r- [Hugo Blox Docs](https://docs.hugoblox.com/)\r- [Discord Community](https://discord.gg/z8wNYzb)\r- [GitHub](https://github.com/HugoBlox/hugo-blox-builder)\r- Features\r- Markdown formatting\r- **inline** ~~text~~ *styles*\r- multiline\rtext\r- `inline code`\r-\r```js\rconsole.log(\u0026#39;hello\u0026#39;);\rconsole.log(\u0026#39;code block\u0026#39;);\r```\r- Math: $x = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}$ Highlighting Highlight important text with mark:\n\u0026lt;mark\u0026gt;Highlighted text\u0026lt;/mark\u0026gt; Callouts Use (aka asides, hints, or alerts) to draw attention to notes, tips, and warnings.\nBy wrapping a paragraph in {{% callout note %}} ... {{% /callout %}}, it will render as an aside.\n{{% callout note %}} A Markdown aside is useful for displaying notices, hints, or definitions to your readers. {{% /callout %}} renders as\nA Markdown aside is useful for displaying notices, hints, or definitions to your readers. Or use the warning callout type so your readers don’t miss critical details:\nA Markdown aside is useful for displaying notices, hints, or definitions to your readers. Did you find this page helpful? Consider sharing it 🙌 ","date":1698278400,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698278400,"objectID":"0c66784ff876bf30b3e6eb6ed466805a","permalink":"http://localhost:1313/post/second-brain/","publishdate":"2023-10-26T00:00:00Z","relpermalink":"/post/second-brain/","section":"post","summary":"Create a personal knowledge base and share your knowledge with your peers.","tags":["Second Brain","Markdown"],"title":"🧠 Sharpen your thinking with a second brain","type":"post"},{"authors":["Gopika Govindan"],"categories":null,"content":"Hugo Blox is designed to give technical content creators a seamless experience. You can focus on the content and Hugo Blox handles the rest.\nUse popular tools such as Plotly, Mermaid, and data frames.\nCharts Hugo Blox supports the popular format for interactive data visualizations. With Plotly, you can design almost any kind of visualization you can imagine!\nSave your Plotly JSON in your page folder, for example line-chart.json, and then add the {{\u0026lt; chart data=\u0026#34;line-chart\u0026#34; \u0026gt;}} shortcode where you would like the chart to appear.\nDemo:\nYou might also find the useful.\nDiagrams Hugo Blox supports the Mermaid Markdown extension for diagrams.\nAn example flowchart:\n```mermaid\rgraph TD\rA[Hard] --\u0026gt;|Text| B(Round)\rB --\u0026gt; C{Decision}\rC --\u0026gt;|One| D[Result 1]\rC --\u0026gt;|Two| E[Result 2]\r```\rrenders as\ngraph TD\rA[Hard] --\u0026gt;|Text| B(Round)\rB --\u0026gt; C{Decision}\rC --\u0026gt;|One| D[Result 1]\rC --\u0026gt;|Two| E[Result 2] An example sequence diagram:\n```mermaid\rsequenceDiagram\rAlice-\u0026gt;\u0026gt;John: Hello John, how are you?\rloop Healthcheck\rJohn-\u0026gt;\u0026gt;John: Fight against hypochondria\rend\rNote right of John: Rational thoughts!\rJohn--\u0026gt;\u0026gt;Alice: Great!\rJohn-\u0026gt;\u0026gt;Bob: How about you?\rBob--\u0026gt;\u0026gt;John: Jolly good!\r```\rrenders as\nsequenceDiagram\rAlice-\u0026gt;\u0026gt;John: Hello John, how are you?\rloop Healthcheck\rJohn-\u0026gt;\u0026gt;John: Fight against hypochondria\rend\rNote right of John: Rational thoughts!\rJohn--\u0026gt;\u0026gt;Alice: Great!\rJohn-\u0026gt;\u0026gt;Bob: How about you?\rBob--\u0026gt;\u0026gt;John: Jolly good! An example class diagram:\n```mermaid\rclassDiagram\rClass01 \u0026lt;|-- AveryLongClass : Cool\rClass03 *-- Class04\rClass05 o-- Class06\rClass07 .. Class08\rClass09 --\u0026gt; C2 : Where am i?\rClass09 --* C3\rClass09 --|\u0026gt; Class07\rClass07 : equals()\rClass07 : Object[] elementData\rClass01 : size()\rClass01 : int chimp\rClass01 : int gorilla\rClass08 \u0026lt;--\u0026gt; C2: Cool label\r```\rrenders as\nclassDiagram\rClass01 \u0026lt;|-- AveryLongClass : Cool\rClass03 *-- Class04\rClass05 o-- Class06\rClass07 .. Class08\rClass09 --\u0026gt; C2 : Where am i?\rClass09 --* C3\rClass09 --|\u0026gt; Class07\rClass07 : equals()\rClass07 : Object[] elementData\rClass01 : size()\rClass01 : int chimp\rClass01 : int gorilla\rClass08 \u0026lt;--\u0026gt; C2: Cool label An example state diagram:\n```mermaid\rstateDiagram\r[*] --\u0026gt; Still\rStill --\u0026gt; [*]\rStill --\u0026gt; Moving\rMoving --\u0026gt; Still\rMoving --\u0026gt; Crash\rCrash --\u0026gt; [*]\r```\rrenders as\nstateDiagram\r[*] --\u0026gt; Still\rStill --\u0026gt; [*]\rStill --\u0026gt; Moving\rMoving --\u0026gt; Still\rMoving --\u0026gt; Crash\rCrash --\u0026gt; [*] Data Frames Save your spreadsheet as a CSV file in your page’s folder and then render it by adding the Table shortcode to your page:\n{{\u0026lt; table path=\u0026#34;results.csv\u0026#34; header=\u0026#34;true\u0026#34; caption=\u0026#34;Table 1: My results\u0026#34; \u0026gt;}} renders as\ncustomer_id score 1 0 2 0.5 3 1 Table 1: My results Did you find this page helpful? Consider sharing it 🙌 ","date":1698192000,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698192000,"objectID":"394deaee734c5d39008fa0100b24bc0d","permalink":"http://localhost:1313/post/data-visualization/","publishdate":"2023-10-25T00:00:00Z","relpermalink":"/post/data-visualization/","section":"post","summary":"Use popular tools such as Plotly, Mermaid, and data frames.","tags":["Hugo","Hugo Blox","Markdown"],"title":"📈 Communicate your results effectively with the best data visualizations","type":"post"},{"authors":["Gopika Govindan"],"categories":null,"content":" is designed to give technical content creators a seamless experience. You can focus on the content and the Hugo Blox Builder which this template is built upon handles the rest.\nEmbed videos, podcasts, code, LaTeX math, and even test students!\nOn this page, you’ll find some examples of the types of technical content that can be rendered with Hugo Blox.\nVideo Teach your course by sharing videos with your students. Choose from one of the following approaches:\nYoutube:\n{{\u0026lt; youtube D2vj0WcvH5c \u0026gt;}}\rBilibili:\n{{\u0026lt; bilibili BV1WV4y1r7DF \u0026gt;}}\rVideo file\nVideos may be added to a page by either placing them in your assets/media/ media library or in your , and then embedding them with the video shortcode:\n{{\u0026lt; video src=\u0026#34;my_video.mp4\u0026#34; controls=\u0026#34;yes\u0026#34; \u0026gt;}}\rPodcast You can add a podcast or music to a page by placing the MP3 file in the page’s folder or the media library folder and then embedding the audio on your page with the audio shortcode:\n{{\u0026lt; audio src=\u0026#34;ambient-piano.mp3\u0026#34; \u0026gt;}}\rTry it out:\nTest students Provide a simple yet fun self-assessment by revealing the solutions to challenges with the spoiler shortcode:\n{{\u0026lt; spoiler text=\u0026#34;👉 Click to view the solution\u0026#34; \u0026gt;}} You found me! {{\u0026lt; /spoiler \u0026gt;}} renders as\n👉 Click to view the solution You found me 🎉 Math Hugo Blox Builder supports a Markdown extension for $\\LaTeX$ math. Enable math by setting the math: true option in your page’s front matter, or enable math for your entire site by toggling math in your config/_default/params.yaml file:\nfeatures: math: enable: true To render inline or block math, wrap your LaTeX math with $...$ or $$...$$, respectively.\nExample math block:\n$$ \\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2} $$ renders as\n$$\\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2}$$Example inline math $\\nabla F(\\mathbf{x}_{n})$ renders as $\\nabla F(\\mathbf{x}_{n})$.\nExample multi-line math using the math linebreak (\\\\):\n$$f(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\ 1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}$$ renders as\n$$\rf(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\\r1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}\r$$Code Hugo Blox Builder utilises Hugo’s Markdown extension for highlighting code syntax. The code theme can be selected in the config/_default/params.yaml file.\n```python\rimport pandas as pd\rdata = pd.read_csv(\u0026#34;data.csv\u0026#34;)\rdata.head()\r```\rrenders as\nimport pandas as pd data = pd.read_csv(\u0026#34;data.csv\u0026#34;) data.head() Inline Images {{\u0026lt; icon name=\u0026#34;python\u0026#34; \u0026gt;}} Python renders as\nPython\nDid you find this page helpful? Consider sharing it 🙌 ","date":1698105600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698105600,"objectID":"0f953cedd41c4f26bc7a5782d98b17c7","permalink":"http://localhost:1313/post/teach-courses/","publishdate":"2023-10-24T00:00:00Z","relpermalink":"/post/teach-courses/","section":"post","summary":"Embed videos, podcasts, code, LaTeX math, and even test students!","tags":["Hugo","Hugo Blox Builder","Markdown"],"title":"👩🏼‍🏫 Teach academic courses","type":"post"},{"authors":null,"categories":null,"content":"","date":1698105600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698105600,"objectID":"4e341564189a2e1a1cb21603ba4c1d9e","permalink":"http://localhost:1313/experience/","publishdate":"2023-10-24T00:00:00Z","relpermalink":"/experience/","section":"","summary":"","tags":null,"title":"Experience","type":"landing"},{"authors":null,"categories":null,"content":" is designed to give technical content creators a seamless experience. You can focus on the content and the Hugo Blox Builder which this template is built upon handles the rest.\nEmbed videos, podcasts, code, LaTeX math, and even test students!\nOn this page, you’ll find some examples of the types of technical content that can be rendered with Hugo Blox.\nVideo Teach your course by sharing videos with your students. Choose from one of the following approaches:\nYoutube:\n{{\u0026lt; youtube w7Ft2ymGmfc \u0026gt;}}\rBilibili:\n{{\u0026lt; bilibili id=\u0026#34;BV1WV4y1r7DF\u0026#34; \u0026gt;}}\rVideo file\nVideos may be added to a page by either placing them in your assets/media/ media library or in your , and then embedding them with the video shortcode:\n{{\u0026lt; video src=\u0026#34;my_video.mp4\u0026#34; controls=\u0026#34;yes\u0026#34; \u0026gt;}}\rPodcast You can add a podcast or music to a page by placing the MP3 file in the page’s folder or the media library folder and then embedding the audio on your page with the audio shortcode:\n{{\u0026lt; audio src=\u0026#34;ambient-piano.mp3\u0026#34; \u0026gt;}}\rTry it out:\nTest students Provide a simple yet fun self-assessment by revealing the solutions to challenges with the spoiler shortcode:\n{{\u0026lt; spoiler text=\u0026#34;👉 Click to view the solution\u0026#34; \u0026gt;}} You found me! {{\u0026lt; /spoiler \u0026gt;}} renders as\n👉 Click to view the solution You found me 🎉 Math Hugo Blox Builder supports a Markdown extension for $\\LaTeX$ math. You can enable this feature by toggling the math option in your config/_default/params.yaml file.\nTo render inline or block math, wrap your LaTeX math with {{\u0026lt; math \u0026gt;}}$...${{\u0026lt; /math \u0026gt;}} or {{\u0026lt; math \u0026gt;}}$$...$${{\u0026lt; /math \u0026gt;}}, respectively.\nWe wrap the LaTeX math in the Hugo Blox math shortcode to prevent Hugo rendering our math as Markdown. Example math block:\n{{\u0026lt; math \u0026gt;}} $$ \\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2} $$ {{\u0026lt; /math \u0026gt;}} renders as\n$$\\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2}$$\rExample inline math {{\u0026lt; math \u0026gt;}}$\\nabla F(\\mathbf{x}_{n})${{\u0026lt; /math \u0026gt;}} renders as $\\nabla F(\\mathbf{x}_{n})$ .\nExample multi-line math using the math linebreak (\\\\):\n{{\u0026lt; math \u0026gt;}} $$f(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\ 1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}$$ {{\u0026lt; /math \u0026gt;}} renders as\n$$\rf(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\\r1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}\r$$\rCode Hugo Blox Builder utilises Hugo’s Markdown extension for highlighting code syntax. The code theme can be selected in the config/_default/params.yaml file.\n```python\rimport pandas as pd\rdata = pd.read_csv(\u0026#34;data.csv\u0026#34;)\rdata.head()\r```\rrenders as\nimport pandas as pd data = pd.read_csv(\u0026#34;data.csv\u0026#34;) data.head() Inline Images {{\u0026lt; icon name=\u0026#34;python\u0026#34; \u0026gt;}} Python renders as\nPython\nDid you find this page helpful? Consider sharing it 🙌 ","date":1698105600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698105600,"objectID":"6c17369804548d4a82c208c239202b19","permalink":"http://localhost:1313/teaching/js/","publishdate":"2023-10-24T00:00:00Z","relpermalink":"/teaching/js/","section":"teaching","summary":"Easily learn JavaScript in 10 minutes!","tags":["JavaScript"],"title":"Learn JavaScript","type":"docs"},{"authors":null,"categories":null,"content":" is designed to give technical content creators a seamless experience. You can focus on the content and the Hugo Blox Builder which this template is built upon handles the rest.\nEmbed videos, podcasts, code, LaTeX math, and even test students!\nOn this page, you’ll find some examples of the types of technical content that can be rendered with Hugo Blox.\nVideo Teach your course by sharing videos with your students. Choose from one of the following approaches:\nYoutube:\n{{\u0026lt; youtube w7Ft2ymGmfc \u0026gt;}}\rBilibili:\n{{\u0026lt; bilibili id=\u0026#34;BV1WV4y1r7DF\u0026#34; \u0026gt;}}\rVideo file\nVideos may be added to a page by either placing them in your assets/media/ media library or in your , and then embedding them with the video shortcode:\n{{\u0026lt; video src=\u0026#34;my_video.mp4\u0026#34; controls=\u0026#34;yes\u0026#34; \u0026gt;}}\rPodcast You can add a podcast or music to a page by placing the MP3 file in the page’s folder or the media library folder and then embedding the audio on your page with the audio shortcode:\n{{\u0026lt; audio src=\u0026#34;ambient-piano.mp3\u0026#34; \u0026gt;}}\rTry it out:\nTest students Provide a simple yet fun self-assessment by revealing the solutions to challenges with the spoiler shortcode:\n{{\u0026lt; spoiler text=\u0026#34;👉 Click to view the solution\u0026#34; \u0026gt;}} You found me! {{\u0026lt; /spoiler \u0026gt;}} renders as\n👉 Click to view the solution You found me 🎉 Math Hugo Blox Builder supports a Markdown extension for $\\LaTeX$ math. You can enable this feature by toggling the math option in your config/_default/params.yaml file.\nTo render inline or block math, wrap your LaTeX math with {{\u0026lt; math \u0026gt;}}$...${{\u0026lt; /math \u0026gt;}} or {{\u0026lt; math \u0026gt;}}$$...$${{\u0026lt; /math \u0026gt;}}, respectively.\nWe wrap the LaTeX math in the Hugo Blox math shortcode to prevent Hugo rendering our math as Markdown. Example math block:\n{{\u0026lt; math \u0026gt;}} $$ \\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2} $$ {{\u0026lt; /math \u0026gt;}} renders as\n$$\\gamma_{n} = \\frac{ \\left | \\left (\\mathbf x_{n} - \\mathbf x_{n-1} \\right )^T \\left [\\nabla F (\\mathbf x_{n}) - \\nabla F (\\mathbf x_{n-1}) \\right ] \\right |}{\\left \\|\\nabla F(\\mathbf{x}_{n}) - \\nabla F(\\mathbf{x}_{n-1}) \\right \\|^2}$$\rExample inline math {{\u0026lt; math \u0026gt;}}$\\nabla F(\\mathbf{x}_{n})${{\u0026lt; /math \u0026gt;}} renders as $\\nabla F(\\mathbf{x}_{n})$ .\nExample multi-line math using the math linebreak (\\\\):\n{{\u0026lt; math \u0026gt;}} $$f(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\ 1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}$$ {{\u0026lt; /math \u0026gt;}} renders as\n$$\rf(k;p_{0}^{*}) = \\begin{cases}p_{0}^{*} \u0026amp; \\text{if }k=1, \\\\\r1-p_{0}^{*} \u0026amp; \\text{if }k=0.\\end{cases}\r$$\rCode Hugo Blox Builder utilises Hugo’s Markdown extension for highlighting code syntax. The code theme can be selected in the config/_default/params.yaml file.\n```python\rimport pandas as pd\rdata = pd.read_csv(\u0026#34;data.csv\u0026#34;)\rdata.head()\r```\rrenders as\nimport pandas as pd data = pd.read_csv(\u0026#34;data.csv\u0026#34;) data.head() Inline Images {{\u0026lt; icon name=\u0026#34;python\u0026#34; \u0026gt;}} Python renders as\nPython\nDid you find this page helpful? Consider sharing it 🙌 ","date":1698105600,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698105600,"objectID":"d4c4484c2311880316f74cfc7e5ef4aa","permalink":"http://localhost:1313/teaching/python/","publishdate":"2023-10-24T00:00:00Z","relpermalink":"/teaching/python/","section":"teaching","summary":"Easily learn Python in 10 minutes!","tags":["Python"],"title":"Learn Python","type":"docs"},{"authors":["Gopika Govindan"],"categories":null,"content":"Easily manage your projects - create ideation mind maps, Gantt charts, todo lists, and more!\nIdeation Hugo Blox supports a Markdown extension for mindmaps.\nSimply insert a Markdown code block labelled as markmap and optionally set the height of the mindmap as shown in the example below.\nMindmaps can be created by simply writing the items as a Markdown list within the markmap code block, indenting each item to create as many sub-levels as you need:\n```markmap {height=\u0026#34;200px\u0026#34;}\r- Hugo Modules\r- Hugo Blox\r- blox-plugins-netlify\r- blox-plugins-netlify-cms\r- blox-plugins-reveal\r```\rrenders as\n- Hugo Modules\r- Hugo Blox\r- blox-plugins-netlify\r- blox-plugins-netlify-cms\r- blox-plugins-reveal Diagrams Hugo Blox supports the Mermaid Markdown extension for diagrams.\nAn example Gantt diagram:\n```mermaid\rgantt\rsection Section\rCompleted :done, des1, 2014-01-06,2014-01-08\rActive :active, des2, 2014-01-07, 3d\rParallel 1 : des3, after des1, 1d\rParallel 2 : des4, after des1, 1d\rParallel 3 : des5, after des3, 1d\rParallel 4 : des6, after des4, 1d\r```\rrenders as\ngantt\rsection Section\rCompleted :done, des1, 2014-01-06,2014-01-08\rActive :active, des2, 2014-01-07, 3d\rParallel 1 : des3, after des1, 1d\rParallel 2 : des4, after des1, 1d\rParallel 3 : des5, after des3, 1d\rParallel 4 : des6, after des4, 1d Todo lists You can even write your todo lists in Markdown too:\n- [x] Write math example - [x] Write diagram example - [ ] Do something else renders as\nWrite math example Write diagram example Do something else Did you find this page helpful? Consider sharing it 🙌 ","date":1698019200,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":1698019200,"objectID":"f115df9f24798ddc2677830ad4e5d25e","permalink":"http://localhost:1313/post/project-management/","publishdate":"2023-10-23T00:00:00Z","relpermalink":"/post/project-management/","section":"post","summary":"Easily manage your projects - create ideation mind maps, Gantt charts, todo lists, and more!","tags":["Hugo Blox","Markdown"],"title":"✅ Manage your projects","type":"post"}]